DataProcessors/TouchВыравнивание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>TouchВыравнивание</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтступСлева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтступСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтступСправа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтступСнизу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/TouchВыравнивание/Ext/ObjectModule.bsl
//	1С:Touch. Touch-ориентированные элементы управления и диалоговые формы, 
//	построенные с использованием только стандартных элементов управления платформы.
//	Copyright (C) 2008-2010 Переверзев Александр Владимирович.
//
//	Это программа является свободным программным обеспечением. Вы можете 
//	распространять и/или модифицировать её согласно условиям Стандартной 
//	Общественной Лицензии GNU, опубликованной Фондом Свободного Программного 
//	Обеспечения, версии 3 или, по Вашему желанию, любой более поздней версии. 
//
//	Эта программа распространяется в надежде, что она будет полезной, но БЕЗ 
//	ВСЯКИХ ГАРАНТИЙ, в том числе подразумеваемых гарантий ТОВАРНОГО СОСТОЯНИЯ ПРИ 
//	ПРОДАЖЕ и ГОДНОСТИ ДЛЯ ОПРЕДЕЛЁННОГО ПРИМЕНЕНИЯ. Смотрите Стандартную 
//	Общественную Лицензию GNU для получения дополнительной информации. 
//
//	Вы должны были получить копию Стандартной Общественной Лицензии GNU вместе 
//	с программой. В случае её отсутствия, посмотрите <http://www.gnu.org/licenses/>.


#Если Клиент Тогда

Процедура Получить(ОтступСлева = Неопределено, ОтступСверху = Неопределено, ОтступСправа = Неопределено, ОтступСнизу = Неопределено) Экспорт
	
	// Получение данных.
	ОтступСлева = ЭтотОбъект.ОтступСлева;
	ОтступСверху = ЭтотОбъект.ОтступСверху;
	ОтступСправа = ЭтотОбъект.ОтступСправа;
	ОтступСнизу = ЭтотОбъект.ОтступСнизу;
	
КонецПроцедуры

Процедура Установить(ОтступСлева = Неопределено, ОтступСверху = Неопределено, ОтступСправа = Неопределено, ОтступСнизу = Неопределено) Экспорт
	
	// Установка данных.
	Если (Не ОтступСлева = Неопределено) Тогда
		ЭтотОбъект.ОтступСлева = ОтступСлева;
	КонецЕсли;
	Если (Не ОтступСверху = Неопределено) Тогда
		ЭтотОбъект.ОтступСверху = ОтступСверху;
	КонецЕсли;
	Если (Не ОтступСправа = Неопределено) Тогда
		ЭтотОбъект.ОтступСправа = ОтступСправа;
	КонецЕсли;
	Если (Не ОтступСнизу = Неопределено) Тогда
		ЭтотОбъект.ОтступСнизу = ОтступСнизу;
	КонецЕсли;
	
КонецПроцедуры


// Инициализация значений по умолчанию.
ОтступСлева = 6;
ОтступСверху = 6;
ОтступСправа = 6;
ОтступСнизу = 6;


// Инициализация по единым стандартам.
Попытка Выполнить("Touch.Выравнивание(ЭтотОбъект)"); Исключение КонецПопытки;

#КонецЕсли
